'''
3)Проверка на четность:
Напишите функцию, которая проверяет, является ли число четным.
4)Проверка на палиндром:
Напишите функцию, которая проверяет, является ли строка палиндромом (читается одинаково как слева направо, так и справа налево).
5)Вычисление факториала:
Напишите функцию, которая вычисляет факториал заданного числа.
6)Поиск числа Фибоначчи:
Напишите функцию, которая возвращает n-е число Фибоначчи.
7)Поиск простых чисел:
Напишите функцию, которая находит все простые числа в диапазоне от 2 до n.
Сортировка списка:
Напишите функцию, которая сортирует список чисел в порядке возрастания.
Обрезка строки:
Напишите функцию, которая обрезает заданную строку до определенной длины и добавляет многоточие в конце, если строка была обрезана.
Поиск уникальных элементов:
Напишите функцию, которая принимает список и возвращает новый список, содержащий только уникальные элементы.
Проверка на простоту:
Напишите функцию, которая проверяет, является ли заданное число простым.
Реверс строки:
Напишите функцию, которая переворачивает заданную строку.
Разделение списка:
Напишите функцию, которая разделяет список чисел на четные и нечетные элементы.
Поиск наибольшего общего делителя:
Напишите функцию, которая находит наибольший общий делитель двух чисел.
Поиск наименьшего общего кратного:
Напишите функцию, которая находит наименьшее общее кратное двух чисел.
Поиск повторяющегося элемента:
Напишите функцию, которая находит первый повторяющийся элемент в списке.
Объединение двух списков:
Напишите функцию, которая объединяет два списка в один, удаляя дубликаты.
Проверка на анаграмму:
Напишите функцию, которая проверяет, являются ли две заданные строки анаграммами (имеют ли они одинаковые символы в разном порядке).
Проверка на симметрию:
Напишите функцию, которая проверяет, является ли заданное число симметричным (палиндромом).
Решение квадратного уравнения:
Напишите функцию, которая находит корни квадратного уравнения.
Поиск наибольшей возрастающей подпоследовательности:
Напишите функцию, которая находит наибольшую возрастающую подпоследовательность в списке чисел.
Поиск числа в отсортированном массиве:
Напишите функцию, которая выполняет бинарный поиск числа в отсортированном массиве.
Объединение интервалов:
Напишите функцию, которая объединяет пересекающиеся интервалы.
Проверка на баланс скобок:
Напишите функцию, которая проверяет, сбалансированы ли скобки в строке.
Нахождение всех перестановок:
Напишите функцию, которая находит все перестановки заданной строки.
Поиск подстроки в строке:
Напишите функцию, которая находит все вхождения заданной подстроки в строку.
Проверка на палиндром перестановки:
Напишите функцию, которая проверяет, можно ли переставить символы строки так, чтобы получился палиндром.
Проверка на совпадение шаблона:
Напишите функцию, которая проверяет, соответствует ли заданная строка заданному шаблону.
Разбиение на слова:
Напишите функцию, которая разбивает предложение на слова.
Поиск всех возможных подмножеств:
Напишите функцию, которая находит все возможные подмножества заданного списка.
Проверка на совершенное число:
Напишите функцию, которая проверяет, является ли заданное число совершенным (равным сумме своих делителей).
Поиск суммы цифр числа:
Напишите функцию, которая находит сумму цифр заданного числа.
Сортировка строки по алфавиту:
Напишите функцию, которая сортирует символы строки в алфавитном порядке.
Проверка на арифметическую прогрессию:
Напишите функцию, которая проверяет, является ли заданная последовательность арифметической прогрессией.
Проверка на геометрическую прогрессию:
Напишите функцию, которая проверяет, является ли заданная последовательность геометрической прогрессией.
Поиск кратчайшего пути в графе:
Напишите функцию, которая находит кратчайший путь между двумя вершинами в графе.
Проверка на совершенное число:
Напишите функцию, которая проверяет, является ли заданное число совершенным (равным сумме своих делителей).
Поиск кратчайшего пути в графе:
Напишите функцию, которая находит кратчайший путь между двумя вершинами в графе.
Решение задачи о рюкзаке:
Напишите функцию, которая решает задачу о рюкзаке.
Поиск всех путей в графе:
Напишите функцию, которая находит все пути между двумя вершинами в графе.
Решение задачи о наибольшем подмассиве:
Напишите функцию, которая решает задачу о наибольшем подмассиве.
Проверка на двоичное дерево поиска:
Напишите функцию, которая проверяет, является ли заданное дерево двоичным деревом поиска.
Поиск кратчайшего пути в графе:
Напишите функцию, которая находит кратчайший путь между двумя вершинами в графе.
Решение задачи о наибольшей общей подпоследовательности:
Напишите функцию, которая решает задачу о наибольшей общей подпоследовательности.
Проверка на зацикливание в графе:
Напишите функцию, которая проверяет, есть ли цикл в заданном графе.
Решение задачи о максимальном потоке:
Напишите функцию, которая решает задачу о максимальном потоке в графе.
Поиск максимальной клики в графе:
Напишите функцию, которая находит максимальную клику в заданном графе.
Проверка на связность графа:
Напишите функцию, которая проверяет, связен ли заданный граф.
Поиск минимального остовного дерева:
Напишите функцию, которая находит минимальное остовное дерево в заданном графе.
Решение задачи о коммивояжере:
Напишите функцию, которая решает задачу о коммивояжере.
'''
#1.Сумма двух чисел: Напишите функцию, которая принимает два числа и возвращает их сумму.

def sum_num(a, b):
    sum = a + b
    print(sum)
  
sum_num(4, 6)


#2.Поиск максимального числа: Напишите функцию, которая принимает список чисел и возвращает наибольшее из них.












# Работа со строками и списками:Напишите функцию, которая принимает на вход строку и возвращает список слов в этой строке, отсортированных по длине

def sort_words_by_length(sentence):
    # Разбиваем строку на слова
    words = sentence.split()
    # Сортируем список слов по длине
    sorted_words = sorted(words, key=len)
    return sorted_words

# Пример использования функции
input_sentence = "Это пример предложения для сортировки слов по их длине"
sorted_words = sort_words_by_length(input_sentence)
print(sorted_words)

#Дополнительная задача
a = int(input())
for num in range(1, 10):
    if a < 5: # 1, 2, 3, 4
        print(1)
        break
    elif a < 9 and num > 4: # 5, 6, 7, 8
        print(2)
        break
    elif a < 13 and a > 8: # 9, 10, 11, 12
        print(3)
        break
    elif a < 17 and a > 13: # 13, 14, 15, 16
        print(4)
        break
    elif a < 21 and a > 16: # 17, 18, 19, 20
        print(5)
        break
    elif a < 25 and a > 20: # 21, 22, 23, 24
        print(6)
        break
    elif a < 29 and a > 24: # 25, 26, 27, 28
        print(7)
        break
    elif a < 33 and a > 28: # 29, 30, 31, 32
        print(8)
        break
    elif a < 37 and a > 32:
        print(9)
        break
    else:
        print("error")